# IMDB Movies Lab

### Introduction

In this lesson, we

### Loading our Data

In [133]:
import pandas as pd

movies_df = pd.read_csv('./movie_data/movies.csv')
names_df = pd.read_csv('./movie_data/names.csv')
ratings_df = pd.read_csv('./movie_data/ratings.csv')
title_principals_df = pd.read_csv('./movie_data/title_principals.csv')

/Users/jeffreykatz/miniconda3/envs/minimal_de/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [134]:
movies_df['budget'].notna().sum()

23710

In [135]:
movies_df.columns

Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics'],
      dtype='object')

In [136]:
columns = ['imdb_title_id', 'title', 'year', 
           'date_published', 
 'genre', 'duration', 'country', 'language', 
 'director', 'writer', 'budget', 
 'worlwide_gross_income', 'metascore']

selected_movies_df = movies_df[columns]

budget = selected_movies_df.budget.str.extract('(\d+)').astype('float')
income = selected_movies_df.worlwide_gross_income.str.extract('(\d+)').astype('float')

In [107]:
income = selected_movies_df.worlwide_gross_income.str.extract('(\d+)').astype('float')

In [137]:
movies = selected_movies_df.assign(budget = budget)

In [138]:
movies_df = movies.assign(income = income)

In [139]:
movies_df = movies_df.drop(columns = 'worlwide_gross_income')

In [145]:
movies_df.to_csv('./data/movies.csv', index = False)

In [90]:
select_movie_df = selected_movies_df.assign(budget = budget).assign(income = income)

In [144]:
select_movie_df.to_csv('./movies.csv', index = False)

In [148]:
pd.read_csv('./data/movies.csv')['income']

0              NaN
1              NaN
2              NaN
3              NaN
4              NaN
           ...
85850    3507171.0
85851    7299062.0
85852          NaN
85853       2833.0
85854      59794.0
Name: income, Length: 85855, dtype: float64

In [81]:
cols = ['imdb_name_id', 'name', 'height', 
       'date_of_birth', 'place_of_birth',  'children']

selected_names_df = names_df[cols]
selected_names_df[:2]

,imdb_name_id,name,height,date_of_birth,place_of_birth,children
0,nm0000001,Fred Astaire,177.0,1899-05-10,"Omaha, Nebraska, USA",2
1,nm0000002,Lauren Bacall,174.0,1924-09-16,"The Bronx, New York City, New York, USA",3

In [82]:
birth_year = selected_names_df.date_of_birth.str.split('-').str[0]

In [87]:
selected_names_df = selected_names_df.assign(birth_year = birth_year).drop('date_of_birth', axis = 1)

In [88]:
selected_names_df[:2]

,imdb_name_id,name,height,place_of_birth,children,birth_year
0,nm0000001,Fred Astaire,177.0,"Omaha, Nebraska, USA",2,1899
1,nm0000002,Lauren Bacall,174.0,"The Bronx, New York City, New York, USA",3,1924

In [36]:
cols = ['imdb_title_id', 'weighted_average_vote', 
        'total_votes', 'mean_vote',
       'median_vote']
ratings_df = ratings_df[cols]

In [42]:
cols = ['imdb_title_id', 'imdb_name_id', 'category']

selected_title_principals_df = title_principals_df[cols]

In [93]:
select_movie_df.to_csv('./data/movies.csv', index = False)

In [95]:
# select_movie_df[:2]

In [97]:
selected_title_principals_df.to_csv('./data/title_principals.csv', index = False)

In [101]:
ratings_df.to_csv('./data/ratings.csv', index = False)

In [102]:
selected_names_df.to_csv('./data/names.csv', index = False)